#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.monitoring.azurerm_monitor_action_group.io_com_error must be replaced
-/+ resource "azurerm_monitor_action_group" "io_com_error" {
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> (known after apply)
        name                = "io-p-com-error-ag-01"
      ~ resource_group_name = "io-p-itn-msgs-rg-01" -> "io-p-itn-com-rg-01" # forces replacement
      - tags                = {} -> null
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.monitoring.azurerm_monitor_scheduled_query_rules_alert.message-ingestion-alert must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert" "message-ingestion-alert" {
      - authorized_resource_ids = [] -> null
      ~ frequency               = 30 -> 10
      ~ id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/scheduledQueryRules/[io-p-itn] Message Ingestion Error" -> (known after apply)
      ~ name                    = "[io-p-itn] Message Ingestion Error" -> "[io-p-itn-com] Message Ingestion Error" # forces replacement
      ~ query                   = <<-EOT
            customEvents
            | where name startswith "io.com.message.ingestion"
            | summarize AggregatedValue = count() by bin(timestamp, 30m)
          - | where AggregatedValue > 1
          + | where AggregatedValue >= 1
        EOT
      ~ resource_group_name     = "io-p-itn-msgs-rg-01" -> "io-p-itn-com-rg-01" # forces replacement
      - tags                    = {} -> null
      - throttling              = 0 -> null
        # (8 unchanged attributes hidden)

      ~ action {
          ~ action_group           = [
              - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.monitoring.azurerm_monitor_scheduled_query_rules_alert.message-ingestion-count-collect-alert must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert" "message-ingestion-count-collect-alert" {
      - authorized_resource_ids = [] -> null
      ~ frequency               = 30 -> 10
      ~ id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/scheduledQueryRules/[io-p-itn] Message Count Collection Error" -> (known after apply)
      ~ name                    = "[io-p-itn] Message Count Collection Error" -> "[io-p-itn-com] Message Ingestion Count Collection Error" # forces replacement
      ~ query                   = <<-EOT
            customEvents
            | where name == "io.com.message.collect.count_error"
            | summarize AggregatedValue = count() by bin(timestamp, 30m)
          - | where AggregatedValue > 1
          + | where AggregatedValue >= 1
        EOT
      ~ resource_group_name     = "io-p-itn-msgs-rg-01" -> "io-p-itn-com-rg-01" # forces replacement
      - tags                    = {} -> null
      - throttling              = 0 -> null
        # (8 unchanged attributes hidden)

      ~ action {
          ~ action_group           = [
              - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.monitoring.azurerm_monitor_scheduled_query_rules_alert.message-status-ingestion-alert must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert" "message-status-ingestion-alert" {
      - authorized_resource_ids = [] -> null
      ~ frequency               = 30 -> 10
      ~ id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/scheduledQueryRules/[io-p-itn] Message Status Ingestion Error" -> (known after apply)
      ~ name                    = "[io-p-itn] Message Status Ingestion Error" -> "[io-p-itn-com] Message Status Ingestion Error" # forces replacement
      ~ query                   = <<-EOT
            customEvents
            | where name startswith "io.com.message_status.ingestion"
            | summarize AggregatedValue = count() by bin(timestamp, 30m)
          - | where AggregatedValue > 1
          + | where AggregatedValue >= 1
        EOT
      ~ resource_group_name     = "io-p-itn-msgs-rg-01" -> "io-p-itn-com-rg-01" # forces replacement
      - tags                    = {} -> null
      - throttling              = 0 -> null
        # (8 unchanged attributes hidden)

      ~ action {
          ~ action_group           = [
              - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.redis_messages.azurerm_redis_cache.this will be updated in-place
  ~ resource "azurerm_redis_cache" "this" {
      ~ capacity                           = 1 -> 2
      ~ family                             = "P" -> "C"
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Cache/redis/io-p-itn-msgs-redis-01"
        name                               = "io-p-itn-msgs-redis-01"
        tags                               = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (22 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.citizen_func_api will be destroyed
  # (because resource uses count or for_each)
  - resource "azurerm_cosmosdb_sql_role_assignment" "citizen_func_api" {
      - account_name        = "io-p-cosmos-api" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api/sqlRoleAssignments/5d063738-eef9-2f95-dcfb-7b15d737d673" -> null
      - name                = "5d063738-eef9-2f95-dcfb-7b15d737d673" -> null
      - principal_id        = "68e59eb6-1a21-4e16-88ed-724e1cc313c1" -> null
      - resource_group_name = "io-p-rg-internal" -> null
      - role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> null
      - scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api" -> null
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.citizen_func_api["68e59eb6-1a21-4e16-88ed-724e1cc313c1"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "citizen_func_api" {
      + account_name        = "io-p-cosmos-api"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "68e59eb6-1a21-4e16-88ed-724e1cc313c1"
      + resource_group_name = "io-p-rg-internal"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api"
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.citizen_func_api["e52f57fa-250f-43d3-9dac-933c124df9b1"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "citizen_func_api" {
      + account_name        = "io-p-cosmos-api"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "e52f57fa-250f-43d3-9dac-933c124df9b1"
      + resource_group_name = "io-p-rg-internal"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api"
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.citizen_func_com will be destroyed
  # (because resource uses count or for_each)
  - resource "azurerm_cosmosdb_sql_role_assignment" "citizen_func_com" {
      - account_name        = "io-p-itn-com-cosno-01" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01/sqlRoleAssignments/9a9003a1-1b3e-47b0-aaa2-da334555e17a" -> null
      - name                = "9a9003a1-1b3e-47b0-aaa2-da334555e17a" -> null
      - principal_id        = "68e59eb6-1a21-4e16-88ed-724e1cc313c1" -> null
      - resource_group_name = "io-p-itn-com-rg-01" -> null
      - role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> null
      - scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01" -> null
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.citizen_func_com["68e59eb6-1a21-4e16-88ed-724e1cc313c1"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "citizen_func_com" {
      + account_name        = "io-p-itn-com-cosno-01"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "68e59eb6-1a21-4e16-88ed-724e1cc313c1"
      + resource_group_name = "io-p-itn-com-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "68e59eb6-1a21-4e16-88ed-724e1cc313c1"
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.citizen_func_com["e52f57fa-250f-43d3-9dac-933c124df9b1"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "citizen_func_com" {
      + account_name        = "io-p-itn-com-cosno-01"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "68e59eb6-1a21-4e16-88ed-724e1cc313c1"
      + resource_group_name = "io-p-itn-com-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "e52f57fa-250f-43d3-9dac-933c124df9b1"
    }

  # module.web_apps.azurerm_role_assignment.citizen_func_cosmosdb_account_api will be destroyed
  # (because resource uses count or for_each)
  - resource "azurerm_role_assignment" "citizen_func_cosmosdb_account_api" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01/providers/Microsoft.Authorization/roleAssignments/3fd21065-8025-410a-ec34-3d2e6d0b3686" -> null
      - name                                   = "3fd21065-8025-410a-ec34-3d2e6d0b3686" -> null
      - principal_id                           = "68e59eb6-1a21-4e16-88ed-724e1cc313c1" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/9b7fa17d-e63e-47b0-bb0a-15c516ac86ec" -> null
      - role_definition_name                   = "SQL DB Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01" -> null
        # (4 unchanged attributes hidden)
    }

  # module.web_apps.azurerm_role_assignment.citizen_func_cosmosdb_account_api["68e59eb6-1a21-4e16-88ed-724e1cc313c1"] will be created
  + resource "azurerm_role_assignment" "citizen_func_cosmosdb_account_api" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "68e59eb6-1a21-4e16-88ed-724e1cc313c1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "SQL DB Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.azurerm_role_assignment.citizen_func_cosmosdb_account_api["e52f57fa-250f-43d3-9dac-933c124df9b1"] will be created
  + resource "azurerm_role_assignment" "citizen_func_cosmosdb_account_api" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e52f57fa-250f-43d3-9dac-933c124df9b1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "SQL DB Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.azurerm_role_assignment.citizen_func_io_com_cosmos will be destroyed
  # (because resource uses count or for_each)
  - resource "azurerm_role_assignment" "citizen_func_io_com_cosmos" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01/providers/Microsoft.Authorization/roleAssignments/336cbebc-60ad-4472-7ebe-91c538a35059" -> null
      - name                                   = "336cbebc-60ad-4472-7ebe-91c538a35059" -> null
      - principal_id                           = "68e59eb6-1a21-4e16-88ed-724e1cc313c1" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/9b7fa17d-e63e-47b0-bb0a-15c516ac86ec" -> null
      - role_definition_name                   = "SQL DB Contributor" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01" -> null
        # (4 unchanged attributes hidden)
    }

  # module.web_apps.azurerm_role_assignment.citizen_func_io_com_cosmos["68e59eb6-1a21-4e16-88ed-724e1cc313c1"] will be created
  + resource "azurerm_role_assignment" "citizen_func_io_com_cosmos" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "68e59eb6-1a21-4e16-88ed-724e1cc313c1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "SQL DB Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.azurerm_role_assignment.citizen_func_io_com_cosmos["e52f57fa-250f-43d3-9dac-933c124df9b1"] will be created
  + resource "azurerm_role_assignment" "citizen_func_io_com_cosmos" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e52f57fa-250f-43d3-9dac-933c124df9b1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "SQL DB Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.cosmos.module.io_com_cosmos_account.azurerm_monitor_metric_alert.cosmos_db_provisioned_throughput_exceeded[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "cosmos_db_provisioned_throughput_exceeded" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/metricAlerts/[io-p-itn-com-cosno-01] Provisioned Throughput Exceeded"
        name                     = "[io-p-itn-com-cosno-01] Provisioned Throughput Exceeded"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

      ~ action (known after apply)
      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }

        # (1 unchanged block hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01"
        name                                           = "io-p-itn-msgs-sending-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (32 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ sticky_settings {
          ~ app_setting_names       = [
              - "APPINSIGHTS_SAMPLING_PERCENTAGE",
                "SLOT_TASK_HUBNAME",
                "AzureFunctionsJobHost__extensions__durableTask__hubName",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
                "AzureFunctionsWebHost__hostid",
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (30 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-msgs-sending-func-01] Health Check Failed"
        name                     = "io-p-itn-msgs-sending-func-01] Health Check Failed"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

      ~ action (known after apply)
      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }

        # (1 unchanged block hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitnmsgssendingstfn01] Low Availability"
        name                     = "[iopitnmsgssendingstfn01] Low Availability"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

      ~ action (known after apply)
      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }

        # (1 unchanged block hidden)
    }

  # module.web_apps.module.citizen_func.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-com-citizen-func-01] Health Check Failed"
        name                     = "io-p-itn-com-citizen-func-01] Health Check Failed"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (9 unchanged attributes hidden)

      ~ action (known after apply)
      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }

        # (1 unchanged block hidden)
    }

  # module.web_apps.module.citizen_func.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitncomcitizenstfn01] Low Availability"
        name                     = "[iopitncomcitizenstfn01] Low Availability"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

      ~ action (known after apply)
      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }

        # (1 unchanged block hidden)
    }

  # module.web_apps.module.etl_func.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/metricAlerts/io-p-itn-com-etl-func-01] Health Check Failed"
        name                     = "io-p-itn-com-etl-func-01] Health Check Failed"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

      ~ action (known after apply)
      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }

        # (1 unchanged block hidden)
    }

  # module.web_apps.module.etl_func.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitncometlstfn01] Low Availability"
        name                     = "[iopitncometlstfn01] Low Availability"
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

      ~ action (known after apply)
      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Insights/actionGroups/io-p-com-error-ag-01" -> null
          - webhook_properties = {} -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 12 to add, 10 to change, 8 to destroy.

Warning: Argument is deprecated

  with module.storage_api_weu.azurerm_storage_container.message_content,
  on ../_modules/storage_accounts/storage_account_api.tf line 32, in resource "azurerm_storage_container" "message_content":
  32:   storage_account_name  = module.storage_api.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
